## Defining DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = np.array([['kor', 70], ['math', 80]])
df = pd.DataFrame(dataset, columns=['class', 'score'])
df

  class score
0   kor    70
1  math    80

## other ways

In [3]:
df = pd.DataFrame([['kor', 70], ['math', 80]], columns=['class', 'score'])
df = pd.DataFrame({'class': ['kor', 'math'], 'score': [70, 80]})
df

  class  score
0   kor     70
1  math     80

##  Defining Series

In [4]:
SR = pd.Series({'idx 1': 10, 'idx 2': 20}, name = 'num')
SR

idx 1    10
idx 2    20
Name: num, dtype: int64

## Read & Save DataFrame

In [5]:
filepath = 'data/iris.csv'
data = pd.read_csv(filepath, na_values='NA', encoding='utf8')

In [6]:
data.to_csv('result.csv', header=True, index=True, encoding='utf8')

## Print DataFrame

In [7]:
from sklearn.datasets import load_iris
iris = load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [8]:
iris.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [9]:
iris.tail()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

## Print All cols & rows

In [10]:
# pd.set_option('display.max_columns', None)

# pd.set_option('display.max_rows', None)

## Basic stats of DataFrame

In [11]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [12]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

## DataFrame Index

In [13]:
df

  class  score
0   kor     70
1  math     80

In [14]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [15]:
list(df.index)

[0, 1]

In [16]:
df.index = ['A', 'B']

In [17]:
df.index

Index(['A', 'B'], dtype='object')

In [18]:
df

  class  score
A   kor     70
B  math     80

## set_index()

**DataFrame.set_index(keys, drop=True, append=False, inplace=True)**

In [19]:
df.set_index('class', drop=True, append=False, inplace=True)
df

       score
class
kor       70
math      80

## reset_index()

**DataFrame.reset_index(drop=False, inplace=False)**

In [20]:
df.reset_index(drop=False, inplace=True)
df

  class  score
0   kor     70
1  math     80

## DataFrame columns

In [21]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [22]:
iris.columns = ['sepal lenth', 'sepal width', 'petal length', 'petal width']
iris

     sepal lenth  sepal width  petal length  petal width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
..           ...          ...           ...          ...
145          6.7          3.0           5.2          2.3
146          6.3          2.5           5.0          1.9
147          6.5          3.0           5.2          2.0
148          6.2          3.4           5.4          2.3
149          5.9          3.0           5.1          1.8

[150 rows x 4 columns]

## replace()

**DataFrame.columns.str.replace('A', 'B')**

In [23]:
iris.columns = iris.columns.str.replace(' ', '_')
iris.head()

   sepal_lenth  sepal_width  petal_length  petal_width
0          5.1          3.5           1.4          0.2
1          4.9          3.0           1.4          0.2
2          4.7          3.2           1.3          0.2
3          4.6          3.1           1.5          0.2
4          5.0          3.6           1.4          0.2

## Data type - cols

In [24]:
iris.dtypes

sepal_lenth     float64
sepal_width     float64
petal_length    float64
petal_width     float64
dtype: object

In [25]:
iris['sepal_length'] = iris['sepal_width'].astype('int')
iris[['sepal_width', 'petal_length']] = iris[['sepal_width', 'petal_length']].astype('int')
iris.head()

   sepal_lenth  sepal_width  petal_length  petal_width  sepal_length
0          5.1            3             1          0.2             3
1          4.9            3             1          0.2             3
2          4.7            3             1          0.2             3
3          4.6            3             1          0.2             3
4          5.0            3             1          0.2             3

## select rows, cols

**DataFrame[n:m]**

In [26]:
iris = load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

## Slicing

In [27]:
iris['sepal length (cm)'].head(4)

0    5.1
1    4.9
2    4.7
3    4.6
Name: sepal length (cm), dtype: float64

In [28]:
iris[['sepal length (cm)', 'sepal width (cm)']].head(4)

   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2
3                4.6               3.1

## loc, iloc

**DataFrame.iloc[row, column]**

In [29]:
iris.iloc[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [30]:
iris.iloc[[1,3,5], 2:4]

   petal length (cm)  petal width (cm)
1                1.4               0.2
3                1.5               0.2
5                1.7               0.4

In [31]:
iris.iloc[:, [True, True, False, True]]

     sepal length (cm)  sepal width (cm)  petal width (cm)
0                  5.1               3.5               0.2
1                  4.9               3.0               0.2
2                  4.7               3.2               0.2
3                  4.6               3.1               0.2
4                  5.0               3.6               0.2
..                 ...               ...               ...
145                6.7               3.0               2.3
146                6.3               2.5               1.9
147                6.5               3.0               2.0
148                6.2               3.4               2.3
149                5.9               3.0               1.8

[150 rows x 3 columns]

**DataFrame.loc[row, column]**

In [32]:
iris.loc[1:3]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [33]:
iris.loc[[1,2], 'sepal length (cm)' : 'petal length (cm)']

   sepal length (cm)  sepal width (cm)  petal length (cm)
1                4.9               3.0                1.4
2                4.7               3.2                1.3

## Value change

In [34]:
score = pd.DataFrame({'kor':[100, 80], 'math':[75, 90], 'eng':[90, 95]}, index=['A', 'B'])
score.loc['A', 'eng'] = 100
score['kor'] = score['kor'] - 5
score

   kor  math  eng
A   95    75  100
B   75    90   95

## Add row & col

In [35]:
# row

new_students = pd.DataFrame({'kor':[70, 85], 'math':[65, 100], 'eng':[95, 65]}, index=['A','B'])
score = score.append(new_students)
new_student1 = pd.Series({'kor':85, 'math':55, 'eng':95}, name='C')
score = score.append(new_student1)
score

C:\Users\ST-USER\AppData\Local\Temp\ipykernel_28764\3856345323.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_students)
C:\Users\ST-USER\AppData\Local\Temp\ipykernel_28764\3856345323.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_student1)

   kor  math  eng
A   95    75  100
B   75    90   95
A   70    65   95
B   85   100   65
C   85    55   95

In [36]:
new_student2 = {'kor':75, 'math':80, 'eng':80}
score.append(new_student2, ignore_index=True)

C:\Users\ST-USER\AppData\Local\Temp\ipykernel_28764\4283258162.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score.append(new_student2, ignore_index=True)

   kor  math  eng
0   95    75  100
1   75    90   95
2   70    65   95
3   85   100   65
4   85    55   95
5   75    80   80

In [37]:
# col

science = [80, 70, 90, 85, 75]
score['sci'] = science
score['Year']= 1
score

   kor  math  eng  sci  Year
A   95    75  100   80     1
B   75    90   95   70     1
A   70    65   95   90     1
B   85   100   65   85     1
C   85    55   95   75     1

In [38]:
score['sci'] = score['sci']+5
score['Total']= score['kor']+score['math']+score['eng']+score['sci']
score

   kor  math  eng  sci  Year  Total
A   95    75  100   85     1    355
B   75    90   95   75     1    335
A   70    65   95   95     1    325
B   85   100   65   90     1    340
C   85    55   95   80     1    315

##  Delete row & col

**DataFrame.drop(index=None, columns=None, inplace=False)**

In [39]:
score.drop('A', inplace=True)
score.drop(columns=['sci', 'Year', 'Total'], inplace=True)
score

   kor  math  eng
B   75    90   95
B   85   100   65
C   85    55   95

## Conditional search & edit

**DataFrame[conditional sentence]**

In [40]:
students = pd.DataFrame({'name': ['A', 'B', 'C', 'D', 'E', 'F'],
                       'kor': [70, 85, None, 100, None, 85],
                       'math': [65, 100, 80, 95, None, 80]})
students[students['name']=='A']

  name   kor  math
0    A  70.0  65.0

**DataFrame[(condition1) & (condition2) & ((condition3) | (condition4))]**

In [41]:
students[(students['kor'] >=80) & (students['math'] >= 80)]

  name    kor   math
1    B   85.0  100.0
3    D  100.0   95.0
5    F   85.0   80.0

## loc[] conditioning

**df.loc[condition.'new_col_name']**

In [42]:
students.loc[6, 'name':'math'] = ['G', 50, 50]
students.loc[(students['kor']>= 80) & (students['math']>= 70), 'P'] = 'Pass'
students.loc[students['P']!= 'Pass', 'P'] = 'Fail'
students

  name    kor   math     P
0    A   70.0   65.0  Fail
1    B   85.0  100.0  Pass
2    C    NaN   80.0  Fail
3    D  100.0   95.0  Pass
4    E    NaN    NaN  Fail
5    F   85.0   80.0  Pass
6    G   50.0   50.0  Fail

**np.select(condition, list, default=default_val)**

In [44]:
condition_list = [(students['kor']>=90),
                 (students['kor']>=80) & (students['kor'] < 90),
                 (students['kor'] >=70) & (students['kor'] <80)]
choice_list = ['A', 'B', 'C']
students['score'] = np.select(condition_list, choice_list, default='F')
students

  name    kor   math     P score
0    A   70.0   65.0  Fail     C
1    B   85.0  100.0  Pass     B
2    C    NaN   80.0  Fail     F
3    D  100.0   95.0  Pass     A
4    E    NaN    NaN  Fail     F
5    F   85.0   80.0  Pass     B
6    G   50.0   50.0  Fail     F

## Null data

### Find Null data

**isna(), isnull()**

### Find Not Null data

**notna(), notnull()**

In [45]:
students.isna()

    name    kor   math      P  score
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False  False  False  False  False
6  False  False  False  False  False

In [46]:
students.notna()

   name    kor   math     P  score
0  True   True   True  True   True
1  True   True   True  True   True
2  True  False   True  True   True
3  True   True   True  True   True
4  True  False  False  True   True
5  True   True   True  True   True
6  True   True   True  True   True

### sum

In [47]:
students.isna().sum()

name     0
kor      2
math     1
P        0
score    0
dtype: int64

### sum(): row sum
### sum(1): col sum

In [48]:
students.isna().sum(1)

0    0
1    0
2    1
3    0
4    2
5    0
6    0
dtype: int64

## Drop Null data

**DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)**

In [49]:
students.dropna()

  name    kor   math     P score
0    A   70.0   65.0  Fail     C
1    B   85.0  100.0  Pass     B
3    D  100.0   95.0  Pass     A
5    F   85.0   80.0  Pass     B
6    G   50.0   50.0  Fail     F

In [50]:
students.dropna(thresh=4)

  name    kor   math     P score
0    A   70.0   65.0  Fail     C
1    B   85.0  100.0  Pass     B
2    C    NaN   80.0  Fail     F
3    D  100.0   95.0  Pass     A
5    F   85.0   80.0  Pass     B
6    G   50.0   50.0  Fail     F

## Replace Null data

**DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None)**

In [52]:
health = pd.DataFrame({'year':[2017, 2018, 2019, 2020, 2021, 2022],
                      'height':[160, 162, 165, None, None, 166],
                      'weight':[53, 52, None, 50, 51, 54],
                      'sight':[1.2, None, 1.2, 1.2, 1.1, 0.8],
                      'ill_abs':[None, None, None, 2, None, 1]})
health.fillna(0)

   year  height  weight  sight  ill_abs
0  2017   160.0    53.0    1.2      0.0
1  2018   162.0    52.0    0.0      0.0
2  2019   165.0     0.0    1.2      0.0
3  2020     0.0    50.0    1.2      2.0
4  2021     0.0    51.0    1.1      0.0
5  2022   166.0    54.0    0.8      1.0

In [53]:
health.fillna(health.mean())

   year  height  weight  sight  ill_abs
0  2017  160.00    53.0    1.2      1.5
1  2018  162.00    52.0    1.1      1.5
2  2019  165.00    52.0    1.2      1.5
3  2020  163.25    50.0    1.2      2.0
4  2021  163.25    51.0    1.1      1.5
5  2022  166.00    54.0    0.8      1.0

In [57]:
health['ill_abs'] = health['ill_abs'].fillna(0)
health['weight']= health['weight'].fillna(health['weight'].mean())
health

   year  height  weight  sight  ill_abs
0  2017   160.0    53.0    1.2      0.0
1  2018   162.0    52.0    1.2      0.0
2  2019   165.0    52.0    1.2      0.0
3  2020   165.0    50.0    1.2      2.0
4  2021   165.0    51.0    1.1      0.0
5  2022   166.0    54.0    0.8      1.0

In [56]:
health.fillna(method='pad', inplace=True)
health

   year  height  weight  sight  ill_abs
0  2017   160.0    53.0    1.2      0.0
1  2018   162.0    52.0    1.2      0.0
2  2019   165.0    52.0    1.2      0.0
3  2020   165.0    50.0    1.2      2.0
4  2021   165.0    51.0    1.1      0.0
5  2022   166.0    54.0    0.8      1.0

## Drop Duplicate data

**DataFrame.drop_duplicates()**

In [58]:
health['height'].drop_duplicates()

0    160.0
1    162.0
2    165.0
5    166.0
Name: height, dtype: float64

In [59]:
set(health['height'])

{160.0, 162.0, 165.0, 166.0}

In [60]:
health[['sight', 'ill_abs']].drop_duplicates()

   sight  ill_abs
0    1.2      0.0
3    1.2      2.0
4    1.1      0.0
5    0.8      1.0

## Sorting data

**DataFrame.sort_index(axis=0, ascending=True, inplace=False)**

In [61]:
iris = load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris.sort_index(ascending=False, inplace=True)
iris.head()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
149                5.9               3.0                5.1               1.8
148                6.2               3.4                5.4               2.3
147                6.5               3.0                5.2               2.0
146                6.3               2.5                5.0               1.9
145                6.7               3.0                5.2               2.3

In [62]:
iris.sort_index(axis=1, ascending=True, inplace=True)
iris.head()

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
149                5.1               1.8                5.9               3.0
148                5.4               2.3                6.2               3.4
147                5.2               2.0                6.5               3.0
146                5.0               1.9                6.3               2.5
145                5.2               2.3                6.7               3.0

**DataFrame.sort_values(by. axis=0, ascending=True, inplace=False)**

In [64]:
iris.sort_values('petal length (cm)')

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
22                 1.0               0.2                4.6               3.6
13                 1.1               0.1                4.3               3.0
14                 1.2               0.2                5.8               4.0
35                 1.2               0.2                5.0               3.2
16                 1.3               0.4                5.4               3.9
..                 ...               ...                ...               ...
131                6.4               2.0                7.9               3.8
105                6.6               2.1                7.6               3.0
117                6.7               2.2                7.7               3.8
122                6.7               2.0                7.7               2.8
118                6.9               2.3                7.7               2.6

[150 rows x 4 columns]

In [65]:
iris.sort_values(['petal width (cm)', 'sepal length (cm)'])

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
13                 1.1               0.1                4.3               3.0
12                 1.4               0.1                4.8               3.0
37                 1.4               0.1                4.9               3.6
9                  1.5               0.1                4.9               3.1
32                 1.5               0.1                5.2               4.1
..                 ...               ...                ...               ...
136                5.6               2.4                6.3               3.4
140                5.6               2.4                6.7               3.1
100                6.0               2.5                6.3               3.3
144                5.7               2.5                6.7               3.3
109                6.1               2.5                7.2               3.6

[150 rows x 4 columns]

## Concatenation

**pandas.concat(objs, axis=0, ignore_index=False)**

In [66]:
HR1 = pd.DataFrame({'name': ['A', 'B'],
                   'dpmt': ['a', 'b'],
                   'pstn': ['c', 'd']})

HR2 = pd.DataFrame({'name': ['E', 'F'],
                   'dpmt': ['g', 'h'],
                   'pstn': ['i', 'l']})
pd.concat([HR1, HR2], axis=0)

  name dpmt pstn
0    A    a    c
1    B    b    d
0    E    g    i
1    F    h    l

In [67]:
pd.concat([HR1, HR2], axis = 0, ignore_index=True)

  name dpmt pstn
0    A    a    c
1    B    b    d
2    E    g    i
3    F    h    l

In [69]:
HR3 = pd.DataFrame({'name': ['A', 'B'],
                   'dpmt': ['a', 'delta'],
                   'sal': [3500, 2800]})
pd.concat([HR1, HR3], axis=0, ignore_index=True)

  name   dpmt pstn     sal
0    A      a    c     NaN
1    B      b    d     NaN
2    A      a  NaN  3500.0
3    B  delta  NaN  2800.0

In [70]:
HR4 = pd.Series({1:2500}, name='delta')
pd.concat([HR1, HR4], axis=1)

  name dpmt pstn   delta
0    A    a    c     NaN
1    B    b    d  2500.0

In [71]:
HR5 = pd.DataFrame({'delta':[4500, 300, 3500]})
pd.concat([HR1, HR5], axis=1)

  name dpmt pstn  delta
0    A    a    c   4500
1    B    b    d    300
2  NaN  NaN  NaN   3500

## Join